Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དགྲའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 52. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be among enemies, consider those bodhisattvas to be on one of the first five bhūmis.

source: དེས་ནི་རྒྱལ་པོར་གྱུར་པ་ན་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་ཐོ་བཙམས་པས་དགྲ་བོ་མང་བ་དང་། བར་ཆད་མང་བ་ཡིན་ཏེ།
en: When those bodhisattvas were kings, they insulted someone observing discipline, and because of that have many enemies and obstacles.

source: དེས་མི་གནས་པ་ལ་སྤྱད་པར་བྱ་ཞིང་སྒྲིབ་པ་མེད་པའི་མཐའ་ལ་ཡང་མོས་པར་བྱ། །གཅིག་ཏུ་ཕན་པ་ལ་ཡང་བརྩོན་པར་བྱ་སྟེ།
en: Such bodhisattvas should practice being without support, orient themselves toward the final limit in which obscurations are absent, and should be singularly focused on being of benefit.

source: དེས་ནི་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their karmic obscurations will be purified and they will find release in awakening.

source: གང་གིས་བདག་མཚོན་སྣ་ཚོགས་ཐོགས་པའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas perceive themselves in the midst of people brandishing a variety of weapons, consider them to be on the first bhūmi.

source: གང་གིས་བདག་མཚོན་སྣ་གཅིག་ཐོགས་པའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves in the midst of people brandishing only one type of weapon, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་བདག་དབྱུག་པ་ཐོགས་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they perceive themselves in the midst of people brandishing clubs, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་བདག་རྡོ་བ་ཐོགས་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they perceive themselves in the midst of people brandishing stones, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་བདག་ལག་པ་སྟོང་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟ་སྟེ།
en: If they perceive themselves in the midst of people with nothing in their hands, consider those bodhisattvas to be on the fifth bhūmi.

source: གཞན་དག་ལ་ནི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །
en: You should understand other signs to be the activity of Māra. 53.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ནམ་མཁའ་ལ་འགྲོ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་བ་དང་། དམིགས་པ་ལས་འདའ་བར་འགྱུར་བའི་མཚམས་ལ་གནས་པ་དང་།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves flying through the sky, they have attained the acceptance that phenomena do not arise and dwell at the threshold of transcending conceptual reference points.

source: ལྷ་རྣམས་ཀྱིས་བསམ་པ་ཡིན་ཏེ་དེས་ནི་གཙང་སྦྲར་སྤྱད་པ་དང་། རྟག་ཏུ་བརྩོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ་ཞིང་སེམས་ཅན་རྣམས་དང་ཕྱོགས་གཅིག་ཏུ་ཡུན་རིང་དུ་གནས་པར་མི་བྱའོ། །
en: The gods think of those bodhisattvas. Such bodhisattvas should practice cleanliness, be constantly diligent, be intent on cultivating the mind of awakening, and not spend a long time in the company of beings.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related karmic obscurations will be purified and they will find release in awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Consider such bodhisattvas to be on one of the first seven bhūmis.

source: གལ་ཏེ་ནམ་མཁའ་ལ་སྦྱིན་པ་སྦྱིན་ཞིང་འགྲོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: If they perceive themselves moving through the sky giving gifts, consider those bodhisattvas to be on the first bhūmi.

source: དྲང་སྲོང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see ṛṣis, consider those bodhisattvas to be on the second bhūmi.

source: དགེ་སྦྱོང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see ascetics, consider those bodhisattvas to be on the third bhūmi.

source: ཀླུ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see nāgas, consider those bodhisattvas to be on the fourth bhūmi.

source: ལྷ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see gods, consider those bodhisattvas to be on the fifth bhūmi.

source: ཚངས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see Brahmā, consider those bodhisattvas to be on the sixth bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ།
en: If they see a bodhisattva or a tathāgata, consider those bodhisattvas to be on the seventh bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གི་ལག་པ་ན་སྒྲོན་མ་ཐོགས་པར་ཀུན་ཏུ་ཤེས་ན་དེས་ཆོས་ཀྱི་སྣང་བ་བསྒྲུབ་པར་བྱ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves holding a lamp in their hand, those bodhisattvas should perfect the light of the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟའོ། །
en: Consider those bodhisattvas to be on one of the first five bhūmis.

source: གལ་ཏེ་དེས་ལུས་དང་། སྲོག་ལ་མི་ལྟ་བར་ཟང་ཟིང་མེད་པ་ལ་རབ་ཏུ་སྦྱོར་བར་བྱེད་ཅིང་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ལ་ཡང་ནེམ་ནུར་མེད་པར་བྱས་ན། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: If such bodhisattvas were to disregard life and limb, cultivate disinterest in worldly affairs, and be unhesitating in acting with wisdom, their related karmic obscurations would be purified and they would find release in awakening.

source: དེ་ལ་ས་དང་པོ་ལ་གནས་པ་ནི་དམིགས་པ་ལ་མངོན་པར་བརྩོན་པ་ལ་དགའ་བར་བྱེད་དོ། །
en: “Bodhisattvas on the first bhūmi should take delight in focusing on reference points.

source: ས་གཉིས་པ་ལ་གནས་པ་ནི་བསམ་གཏན་ལ་མངོན་པར་དགའ་བར་བྱེད་དོ། །
en: Bodhisattvas on the second bhūmi should take delight in meditation.

source: ས་གསུམ་པ་ལ་གནས་པ་ནི་བྱམས་པ་ལ་དགའ་བར་བྱེད་དོ། །
en: Bodhisattvas on the third bhūmi should take delight in loving kindness.

source: ས་བཞི་པ་ལ་གནས་པ་ནི་སྙིང་རྗེ་ལ་དགའ་བར་བྱེད་དོ། །
en: Bodhisattvas on the fourth bhūmi should take delight in compassion.

source: ས་ལྔ་པ་ལ་གནས་པ་ནི་བཏང་སྙོམས་ལ་དགའ་བར་བྱེད་དོ། །
en: Bodhisattvas on the fifth bhūmi should take delight in equanimity.

source: ས་དང་པོ་ལ་གནས་པ་སྣང་བར་འདོད་པས་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱའོ། །
en: “Bodhisattvas on the first bhūmi who wish to achieve illumination should train in recollecting the Buddha.

source: ས་གཉིས་པ་ལ་གནས་པས་ནི་མཆོག་ཏུ་དགའ་བ་སྦྱིན་པར་བྱའོ། །
en: Bodhisattvas on the second bhūmi should give the gift of supreme joy.

source: ས་གསུམ་པ་ལ་གནས་པས་ནི་ཐོས་པ་བཙལ་བར་བྱའོ། །
en: Bodhisattvas on the third bhūmi should seek opportunities to hear teachings.

source: ས་བཞི་པ་ལ་གནས་པས་ནི་གཟུངས་བསྒོམ་པར་བྱའོ། །
en: Bodhisattvas on the fourth bhūmi should cultivate dhāraṇī.

source: ས་ལྔ་པ་ལ་གནས་པས་ནི་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱ་སྟེ།
en: Bodhisattvas on the fifth bhūmi should cultivate emptiness.

source: དེས་ན་སྣང་བ་འཐོབ་པར་འགྱུར་རོ། །
en: By doing so, those bodhisattvas will achieve illumination.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་བྱུང་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 55. “Vajrapramardin, if in a dream bodhisattvas see another bodhisattva departing, consider those bodhisattvas to be on one of the first six bhūmis.

source: དེ་ཚེ་རྗེས་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པར་འགྱུར་ཞིང་འདི་ཙམ་ཞིག་ན་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པར་འགྱུར་བའི་མཚམས་བཅད་པ་ཡང་ཡིན་ནོ། །
en: From that moment onward such bodhisattvas have attained the state of nonregression and establish the prediction that they will become a buddha at a specific time.

source: གང་གིས་རྐང་པས་ཕྱིར་བྱུང་བར་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see another bodhisattva departing on foot, consider them to be on the first bhūmi.

source: གང་གིས་གླང་གི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If those bodhisattvas see another bodhisattva departing on an ox cart, consider them to be on the second bhūmi.

source: གང་གིས་རྟའི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If those bodhisattvas see another bodhisattva departing on a horse-drawn cart, consider them to be on the third bhūmi.

source: གང་གིས་གླང་པོ་ཆེའི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If those bodhisattvas see another bodhisattva departing on an elephant-drawn cart, consider them to be on the fourth bhūmi.

source: གང་གིས་མིའི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If those bodhisattvas see another bodhisattva departing on a human-drawn cart, consider them to be on the fifth bhūmi.

source: གང་གིས་ནམ་མཁའ་ལས་ཕྱིར་བྱུང་བ་མཐོང་ན་ས་དྲུག་པར་བལྟ་སྟེ།
en: If those bodhisattvas see another bodhisattva departing through the sky, consider them to be on the sixth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 56. “Vajrapramardin, if in a dream bodhisattvas find a book, consider those bodhisattvas to be on one of the first three bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ཕྱིར་རྒོལ་བ་དང་། སྐུར་པ་འདེབས་པ་མང་པོ་དག་འབྱུང་བར་འགྱུར་ཡང་བར་ཆད་བྱེད་པར་ནི་མི་འགྱུར་རོ། །
en: Although such bodhisattvas met with a lot of opposition and faced much abuse, no obstacles were created.

source: དེས་སྡིག་པ་བཤགས་པ་ལན་མང་དུ་བྱ་ཞིང་རྟག་ཏུ་མངོན་བར་བརྩོན་པར་ཡང་བྱ་སྟེ།
en: They should confess their evil deeds many times and be consistent in their effort.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་ཡང་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their karmic obscurations will be purified and they will find release in awakening.

source: གལ་ཏེ་འཇིག་རྟེན་པ་དང་། ཉན་ཐོས་དང་ལྡན་པའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas find a book on worldly matters or one pertaining to śrāvakas, consider those bodhisattvas to be on the first bhūmi.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they find a book containing the Perfection of Knowledge, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་ཟབ་མོ་དང་ལྡན་པའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they find a book of profound teachings, consider those bodhisattvas to be on the third bhūmi.

source: བརྩོན་པ་དག་ལ་ལྷའི་བུས་བྱིན་ནམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གདན་ལ་བཞུགས་པས་བྱིན་ན་དེ་ནི་ས་བདུན་པའི་བར་དག་ཏུ་ཡང་བལྟའོ། །
en: If they find a book that was given to an industrious person by a god, bodhisattva, or tathāgata seated on a Dharma seat, consider them to be on one of the first seven bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 57. “Vajrapramardin, if in a dream bodhisattvas hear the sound of a dhāraṇī, consider those bodhisattvas to be on one of the first six bhūmis and to have received dhāraṇīs directly from the Buddha.

source: སངས་རྒྱས་རྣམས་ལས་མངོན་སུམ་དུ་གཟུངས་ཐོབ་པ་ཡིན་ནོ། །
en: Such bodhisattvas have few karmic obscurations but are significantly hindered by the activity of Māra.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་མང་བ་ཡིན་པས་དེས་ན་སྤོབས་པ་སྦྱིན་བར་བྱ་ཞིང་གླགས་ལྟ་བ་མེད་པ་ལ་བརྩོན་པར་ཡང་བྱ་སྟེ།
en: Therefore, they should give the gift of confident eloquence and strive to be those who do not search for faults.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, they will purify their related karmic obscurations and find release in awakening.

source: གལ་ཏེ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྒྲུབས་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas hear the words of a dhāraṇī that has been rendered in verse, consider them to be on the first bhūmi.

source: ཡི་གེས་མངོན་པར་བསྒྲུབས་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they hear the words of a dhāraṇī has been rendered in syllables, consider those bodhisattvas to be on the second bhūmi.

source: ལེགས་པར་བྲིས་པས་མངོན་པར་བསྒྲུབས་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they hear the words of a dhāraṇī that has been rendered in elegant writing, consider those bodhisattvas to be on the third bhūmi.

source: ཀླུས་ཡོངས་སུ་བཟུང་བའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they hear the words of a dhāraṇī that is upheld by nāgas, consider those bodhisattvas to be on the fourth bhūmi.

source: ལྷས་ཡོངས་སུ་བཟུང་བའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they hear the words of a dhāraṇī that is upheld by the gods, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་དོན་དམ་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they hear the words of a dhāraṇī of ultimate truth, consider those bodhisattvas to be on the sixth bhūmi. 58.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas hear the sound of samādhi, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེས་ནི་འཇིག་རྟེན་གསུམ་ལ་ལྷག་པར་ཆགས་པ་མེད་པར་བྱ་ཞིང་རྟག་ཏུ་དབེན་བ་ལ་མངོན་པར་དགའ་བར་ཡང་བྱའོ། །
en: Such bodhisattvas should not harbor strong attachment to the triple world and take constant delight in solitude.

source: དེ་ལ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ཞིང་དེ་ལ་བདུད་ཀྱི་ལས་ཀྱང་ཆུང་མོད་ཀྱི།
en: They have few karmic obscurations and are only influenced by Māra to a small degree.

source: འོན་ཀྱང་དེ་ལ་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཤས་ཆེ་བས་དེས་ཆོས་སྣ་ཚོགས་དག་མཉན་པར་བྱ་ཞིང་སོ་སོར་བརྟག་པ་མང་དུ་ཡང་བྱའོ། །
en: Nevertheless, those bodhisattvas have a predominance of obscurations due to the afflictions, and thus should listen to many types of Dharma teachings and examine those teachings repeatedly.

source: དེ་ལ་རྟོག་པ་དང་བཅས། དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་ནི་ས་དང་པོ་ལ་གནས་པའི་འོ། །
en: “A samādhi that involves both concepts and analysis indicates those bodhisattvas to be on the first bhūmi.

source: རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་ནི་ས་གཉིས་པ་ལ་གནས་པའི་འོ། །
en: A samādhi that involves analysis but no concepts indicates those bodhisattvas to be on the second bhūmi.

source: རྟོག་པ་ཡང་མེད་ལ་དཔྱོད་པ་ཡང་མེད་པའི་ཏིང་ངེ་འཛིན་ནི་ས་གསུམ་པ་ལ་གནས་པའི་འོ། །
en: A samādhi that involves neither concepts nor analysis indicates those bodhisattvas to be on the third bhūmi.

source: ཚངས་པའི་གནས་པ་ནི་ས་བཞི་པ་ལ་གནས་པའི་འོ། །
en: The brahmā states indicate those bodhisattvas to be on the fourth bhūmi.

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ནི་ས་ལྔ་པ་ལ་གནས་པའི་འོ། །
en: The samādhi of emptiness indicates those bodhisattvas to be on the fifth bhūmi.

source: དགོས་པ་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ་ནི་ས་དྲུག་པ་ལ་གནས་པའི་འོ། །
en: The fulfillment of all purposes indicates those bodhisattvas to be on the sixth bhūmi.

source: རིག་པ་ཆེན་པོའི་ས་བདུན་པ་ལ་གནས་པའི་འོ། །
en: Great knowledge indicates those bodhisattvas to be on the seventh bhūmi.

source: སངས་རྒྱས་ཀྱི་བཀོད་པ་བསྒྲུབ་པ་ནི་ས་བརྒྱད་པ་ལ་གནས་པའི་འོ། །
en: Accomplishing the full array of buddhas indicates those bodhisattvas to be on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཤིན་ཏུ་རྒྱས་པའི་སྡེའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 59. “Vajrapramardin, if in a dream bodhisattvas hear the sound of sūtras from the extensive discourses section, consider those bodhisattvas to be on one of the first six bhūmis.

source: དེས་ནི་ཆོས་ལ་མོས་པ་དང་། ངེས་པར་གྱུར་པ་ལ་བཟོད་པར་བྱའོ། །
en: They should revere the Dharma and be patient about release.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྒྲིབ་པ་ཆུང་བ་དང་།
en: Such bodhisattvas have few obscurations and are slow to develop realization.

source: རྟོགས་པ་བུལ་བ་ཡིན་པས་དེས་གཅིག་ཏུ་ཡོངས་སུ་ཞུ་བའི་ངང་ཚུལ་ཅན་དང་། བསྙེན་བཀུར་བྱ་བ་ལ་གདུ་བར་བྱ་སྟེ།
en: They should therefore have a singularly inquisitive disposition and hold in high esteem those who are reverent.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas hear the words of sūtras on the perfection of generosity, consider them to be on the first bhūmi.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they hear the words of sūtras on the perfection of discipline, consider them to be on the second bhūmi.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they hear the words of sūtras on the perfection of patience, consider them to be on the third bhūmi.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་བཞི་པར་བལྟའོ། །
en: If they hear the words of sūtras on the perfection of diligence, consider them to be on the fourth bhūmi.

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་ལྔ་པར་བལྟའོ། །
en: If they hear the words of sūtras on the perfection of meditation, consider them to be on the fifth bhūmi.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་དྲུག་པར་བལྟའོ། །
en: If they hear the words of sūtras on the perfection of knowledge, consider them to be on the sixth bhūmi.

source: མངོན་པར་བརྩོན་པ་དང་། སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་གང་ཟག་ནི་མ་གཏོགས་སོ། །
en: Not included here are those who have made strenuous efforts, who have received blessings from the Buddha, or who have exceedingly earnest intent.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཆོས་སྨྲ་བའི་དགེ་སློང་ཆེ་གེ་མོ་ཞེས་བྱ་བ་རྣམས་ཀྱི་མིང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བྱའོ། །
en: 60. “Vajrapramardin, if in a dream bodhisattvas hear of a Dharma-teaching monk named ‘so-and-so,’ consider those bodhisattvas to be on one of the first four bhūmis. Such bodhisattvas should rely on a spiritual guide.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བར་ཆད་མང་བ་དང་། སེམས་ལ་འགྱོད་པ་མང་བ་དང་། ཤེས་རབ་ཞན་པ་ཡིན་ཏེ།
en: They have many obstacles, experience much regret, and have meager insight.

source: དེས་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་དང་། ཐབས་ལ་མཁས་པ་དང་། ཐབས་ཀྱི་སྡོམ་པ་དང་། ཡིད་ལ་ནེམ་ནུར་མེད་པར་བྱའོ། །
en: They should not feel malice toward any being, be wise in skillful means, be guided by skillful means, and be free of uncertainty.

source: གང་གིས་སྔོན་མ་མཐོང་བའི་དགེ་སློང་གི་མིང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas hear the name of a monk whom they have not seen before, consider them to be on the first bhūmi.

source: གང་གིས་སྔོན་མ་ཐོས་པའི་དགེ་སློང་གི་མིང་ཐོས་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they hear the name of a monk whom they have seen before, consider them to be on the second bhūmi.

source: གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དགེ་སློང་གི་མིང་ཐོས་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they hear the name of a monk who is from another world system, consider them to be on the third bhūmi.

source: གང་གིས་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་མིང་ཐོས་ན་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ།
en: If they hear the name of a monk who is one birth away from awakening, consider them to be on the fourth bhūmi.

source: ས་གོང་མ་དག་ཏུ་ཡང་འདོད་པར་བྱའོ། །
en: Such bodhisattvas should aspire to the higher bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཚིགས་སུ་བཅད་པ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 61. “Vajrapramardin, if in a dream bodhisattvas perceive that they have gained confident eloquence in the verses, consider those bodhisattvas to be on one of the first three bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ། །དེས་གལ་ཏེ་ཆོས་གསུམ་ཡོངས་སུ་སྤངས་ན་མྱུར་དུ་སྣང་བ་འཐོབ་པར་འགྱུར་ཏེ།
en: Such bodhisattvas have an abundance of confident eloquence, but if they forsake three qualities they will quickly attain illumination.

source: ཆོས་གསུམ་གང་ཞེ་ན།
en: What are the three qualities?

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཞན་མཆོད་པ་ལ་ཕྲག་དོག་བྱེད་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་འདོད་པ་དང་། གཡོ་ལ་བསྟེན་པ་སྟེ།
en: Being envious of bodhisattvas worshiped by others, desiring profit and honor, and resorting to deceit.

source: ཆོས་གསུམ་པོ་དེ་དག་ཡོངས་སུ་སྤང་བར་བྱའོ། །
en: Bodhisattvas should forsake those three qualities.

source: གལ་ཏེ་ཚིགས་སུ་བཅད་པ་ཉུང་ངུ་ལ་སྤོབས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas have confident eloquence in a few verses, consider them to be on the first bhūmi.

source: ཚིགས་སུ་བཅད་པ་སྣ་ཚོགས་ལ་སྤོབས་ན་ས་གཉིས་པར་རོ། །
en: If they have confident eloquence in a variety of verses, consider them to be on the second bhūmi.

source: ཟབ་མོའི་ཚིགས་སུ་བཅད་པ་ལ་སྤོབས་ན་ས་གསུམ་པར་རོ། །
en: If they have confident eloquence in verses on the profound, consider them to be on the third bhūmi.

source: རྣམ་པ་མང་པོ་དག་ལ་སྤོབས་ན་ས་གོང་མར་རོ། །
en: If they have confident eloquence in verses of many types, consider them to be on a higher bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མདོ་སྡེ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 62. “Vajrapramardin, if in a dream bodhisattvas perceive that they have gained confident eloquence in the sūtras, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ལ་དགྲ་བོ་མང་བ་དང་།
en: They have many enemies and many good qualities.

source: ཡོན་ཏན་མང་བ་ཡིན་པས་དེས་ཡང་དག་པར་མགུ་བར་བྱེད་པའི་ངང་ཚུལ་ཅན་དུ་བྱ་ཞིང་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་མཆོད་པར་བྱ་བ་དང་།
en: They should therefore adopt a disposition of genuine cheerfulness and should worship those who are uniquely exalted as well as people who behave appropriately.

source: ཇི་ལྟ་བ་བཞིན་དུ་སྤྱོད་པའི་གང་ཟག་ལ་ཡང་མཆོད་པར་བྱ་ཞིང་ཤེས་པས་ལྷག་པའི་ང་རྒྱལ་དུ་ཡང་མི་བྱའོ། །
en: They should avoid feeling pride in their learning.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡང་རྣམ་པར་དག་པར་འགྱུར་ཞིང་རྨི་ལམ་དུ་རྨིས་པའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡང་རྣམ་པར་དག་པར་འགྱུར་ལ་མྱོང་བར་འགྱུར་བ་ཆུང་བར་ཡང་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related karmic obscurations will be purified, as well as those karmic obscurations that have occurred in their dreams. Those that they do experience will be weaker. Such bodhisattvas will find release in awakening.

source: དེ་ལ་བཞི་པ་སྒྲུབ་པ་ལ་སྤོབས་ན་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །
en: “If those bodhisattvas have confident eloquence in The Fourfold Accomplishment, they are on the first bhūmi.

source: ཡོ་བྱད་བསྙུངས་པ་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་གཉིས་པར་རོ། །
en: If they have confident eloquence in sūtras on accomplishing frugality, they are on the second bhūmi.

source: སྣ་ཚོགས་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་གསུམ་པར་རོ། །
en: If they have confident eloquence in sūtras on various accomplishments, they are on the third bhūmi.

source: སྔོན་གྱི་ཚུལ་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་བཞི་པར་རོ། །
en: If they have confident eloquence in sūtras on accomplishing former deeds, they are on the fourth bhūmi.

source: དུས་གསུམ་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་ལྔ་པར་རོ། །
en: If they have confident eloquence in sūtras on practicing in the three times, they are on the fifth bhūmi.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་དྲུག་པར་རོ། །
en: If they have confident eloquence in the perfection of insight sūtras, they are on the sixth bhūmi.

source: མདོ་སྡེ་ཟབ་མོ་ལ་སྤོབས་ན་ས་བདུན་པར་རོ། །
en: If they have confident eloquence in the profound sūtras, they are on the seventh bhūmi.

source: ཐམས་ཅད་རྣམ་པར་གཏན་ལ་འབེབས་པ་ལ་སྤོབས་ན་ས་བརྒྱད་པར་བལྟའོ། །
en: If they have confident eloquence in the ascertainment of all things, consider them to be on the eighth bhūmi.
